public class java001_jvm_jdk_jre {
    /*
    *   jdk:JDK 代表 Java开发工具包。  它是一个软件开发工具包，允许开发人员创建 Java 应用程序。
    *       它包括 Java 运行时环境 (JRE)，以及用于开发和测试 Java 应用程序的各种工具，
    *       例如 Java 编译器和 Java 调试器。
    *   jre:JRE 代表 Java 运行时环境。  它是一个包，其中包含在设备上运行 Java 程序所需的工具。
    *       它包括 Java 虚拟机 (JVM)，以及 Java 程序需要访问的其他类库和资源。
    *   jvm:JVM 代表 Java 虚拟机。  它是一个执行Java字节码的虚拟机，是Java平台的基石。
    *       Java 程序在编译时被编译成字节码，可以在任何安装了 JVM 的设备上运行。
    *       JVM 负责解释字节码并执行其中包含的指令。
    *
    *   java字节码:Java 字节码是 Java 代码的编译形式，旨在由 Java 虚拟机 (JVM) 执行。
    *           它是程序编译后产生的 Java 程序的中间表示。
    *           Java 字节码由一系列在运行时由 JVM 解释的指令组成。
    *           它与平台无关，这意味着 "Java字节码" 可以在任何安装了 JVM 的设备上 运行，
    *           而不管底层硬件和操作系统如何。
     *
    * */

}
